scripts/UC_2_buyItem/result1/Iteration3/t36.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><SOAP-ENV:Body><ns2:PaymentPreferences xmlns:ns2="com.advantage.online.store.accountservice"><ns2:preference><ns2:paymentMethod>10</ns2:paymentMethod><ns2:safePayUsername>AlexJohnson3</ns2:safePayUsername><ns2:safePayPassword>e1fae288a192d13964abfacfca7fa95e34963577</ns2:safePayPassword><ns2:preferenceId>0</ns2:preferenceId></ns2:preference><ns2:preference><ns2:paymentMethod>20</ns2:paymentMethod><ns2:cardNumber>4886789012345678</ns2:cardNumber><ns2:expirationDate>102025</ns2:expirationDate><ns2:cvvNumber>987</ns2:cvvNumber><ns2:customerName>Alex Johnson</ns2:customerName><ns2:preferenceId>0</ns2:preferenceId></ns2:preference></ns2:PaymentPreferences></SOAP-ENV:Body></SOAP-ENV:Envelope>